## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  RESOURCE                                  |
|----------|----------------------------------------------------------------------------|
| update   | `module.model_ecs.aws_ecs_service.this`                                    |
|          | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0]` |
| recreate | `module.model_ecs.aws_ecs_task_definition.this`                            |
| delete   | `aws_security_group_rule.model_ecs_egress_all`                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_security_group_rule.model_ecs_egress_all will be destroyed
  # (because aws_security_group_rule.model_ecs_egress_all is not in configuration)
  - resource "aws_security_group_rule" "model_ecs_egress_all" {
      - cidr_blocks            = [
          - "0.0.0.0/0",
        ] -> null
      - description            = "Allow all outbound traffic from model ECS tasks" -> null
      - from_port              = 0 -> null
      - id                     = "sgrule-4006966016" -> null
      - protocol               = "-1" -> null
      - region                 = "ca-central-1" -> null
      - security_group_id      = "sg-0f95819fa82a6e4c5" -> null
      - security_group_rule_id = "sgr-02b9e1e62a1040ed8" -> null
      - self                   = false -> null
      - to_port                = 0 -> null
      - type                   = "egress" -> null
    }

  # module.model_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "model"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.model_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:517451398792:service/n8n/model"
        name                               = "model"
        tags                               = {
            "CostCentre" = "n8n-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "model:7" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.model_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:517451398792:task-definition/model:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:517451398792:task-definition/model" -> (known after apply)
      ~ container_definitions    = jsonencode( # whitespace changes
            [
                {
                    environment            = [
                        {
                            name  = "OLLAMA_HOST"
                            value = "0.0.0.0"
                        },
                    ]
                    essential              = true
                    image                  = "ollama/ollama:0.9.3@sha256:45008241d61056449dd4f20cebf64bfa5a2168b0c078ecf34aa2779760502c2f"
                    linuxParameters        = {
                        capabilities = {
                            add  = []
                            drop = [
                                "ALL",
                            ]
                        }
                    }
                    logConfiguration       = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/n8n/model"
                            awslogs-region        = "ca-central-1"
                            awslogs-stream-prefix = "task"
                        }
                    }
                    mountPoints            = []
                    name                   = "model"
                    portMappings           = [
                        {
                            containerPort = 11434
                            hostPort      = 11434
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    systemControls         = []
                    volumesFrom            = []
                },
            ]
        )
      ~ cpu                      = "8192" -> "4096" # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "model" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "CostCentre" = "n8n-staging"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0] will be updated in-place
  ~ resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      ~ domains  = [
          - "*.cloudflarestorage.com.",
          - "*.ollama.ai.",
            # (17 unchanged elements hidden)
        ]
        id       = "rslvr-fdl-1d19dea09a724fcb"
        name     = "AllowedDomains"
        tags     = {
            "CostCentre" = "n8n-staging"
            "Terraform"  = "true"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/model_ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 4 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.model_ecs.aws_service_discovery_service.this,
  on .terraform/modules/model_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

